# 1)string methods:

# capitalize() ადიდებს სტრინგის პირველ ასოს
# count() ითვის ერთი და იგივე სიმბოლოებს
# endswith() ამოწმებს მრთავდება თუ არა იმ სიმბოლოზე რომელიც ჩავწერეთ ფრჩხილებში
# find() პოულობს ელემენტის ინდექს თუ არ არის სტრინგში აბრუნებს -1
# index() პოულობს ელემენტის ინდექს თუ არ არის სტრინგში აბრუნებს ერორს
# isalnum() ამოწმებს შედგება თუ არა რიცხვებისგან და ასოებისგან სფეისზე აბრუნებს false
# isalpha()ამოწმებს შედგება თუ არა მარტო  ასოებისგან რიცხვებზე აბრუნებს false
# isdigit()ამოწმებს  შედგება არა თუ მარტო  რიცვებით
# islower()ამოწმებს მარტო პატარა ასოებს 
# isspace()ამოწმებს არის თუ არა მარტო სფეისებით და დააბრუნებს trueს 
# isupper()ამოწმებს შედგება თუ არა მარტო დიდი ასოებით
# join() აერთიანებს სხვადასხვა სტრინგს სიაში
# lower() აპატარავებს ყველა ასოს
# strip() შლის სფეისებს სტრინგში
# lstrip() შლის მარცხნივ სფეისებს
# rstrip()შლის მარჯვინ სფეისებსს
# replace() ცვლის ერტ სიმბოლოს მეორეთი
# split() ყოფს სტრიქონს
# upper() ადიდებს ასოებს
# startswirth() ამოწმებს იწყება თუ არა კონკრეტული სიმბოლოთი