# sport = input("შეიყვანეთ თქვენი საყვარელი სპორტი: ")
# print("თქვენი საყვარელი სპორტი არის " + (sport))


# name = input("შეიყვანეთ თქვენი სახელი: ")
# surname = input("შეიყვანეთ თქვენი გვარი: ")
# age = input("შეიყვანეთ თქვენი ასაკი: ")
# city = input("შეიყვანეთ თქვენი საცხოვრებელი ქალაქი: ")
# hobby = input("შეიყვანეთ თქვენი ჰობი: ")

# print ("შენი სახელია:" + (name))( "გვარი : " + (surname))(" შენი ასაკია " + (age))(" შენ ცხოვრობ" + (city))("-ში და შენი ჰობია "(hobby))


# num = int(input("შეიყვანეთ რიცხვი: "))
# result = (num - 20 * 3)
# print("შედეგი: ") 


# num1 = float(input("შეიყვანეთ პირველი რიცხვი: "))
# num2 = float(input("შეიყვანეთ მეორე რიცხვი: "))
# num3 = float(input("შეიყვანეთ მესამე რიცხვი: "))
# ressult = (num1 + num2 + num3 / 3)
# print("ჯამი : " + ressult)
