# დიქშენარი:

# 1.შექმენი სტუდენტების ქულების დიქშენარი (სახელი → ქულა) და იპოვე რომელი სტუდენტი მიიღო ყველაზე მაღალი ქულა.
name={
    "nika":15,
    "gio":24,
    "saba":21,
    "mari":26
}
print(max(name.values()))

# 2.დაწერე პროგრამა, სადაც დიქშენარში შენახულია პროდუქტების ფასები და დათვალე ჯამური ფასი.
fruit={
    "apple":2,
    "pinaapple":10,
    "orange":4,
    "banana":4,
}
sum=0

for i in fruit.values():
    if i > 0:
        sum+=i
print(sum)
# 3.გქონდეს დიქშენარი წიგნების შესახებ (სათაური → ავტორი) და მოძებნე რომელ ავტორს ეკუთვნის კონკრეტული წიგნი.
books={
    "ვაჟა":"თამაზ ჩხენკელი",
    "ქართული დიპლომატიის ისტორია":"არტანუჯი"
}
names=input("შემოიტანე წიგნის სახელი")
if names == "ვაჟა":
    print("თამაზ ჩხენკელი")
elif names == "ქართული დიპლომატიის ისტორია":
    print("არტანუჯი")

# სეტი:
# 1.დაწერე პროგრამა, სადაც მომხმარებელი შეიყვანს რამდენიმე სიტყვას და შენ უნდა შეინახო მხოლოდ უნიკალური სიტყვები სეტში.
word={"0"}
word1=input("შეიყვანეთ რამოდენიმე სიტყვა")
word3=word.add(word1)
print(word3)
# 2.შექმენი სეტი რიცხვებით 1-დან 10-მდე და ამოიღე ყველა ლუწი რიცხვი და ჩასვი სეტში რომელსაც ლისტად გადააქცევთ list ფუნქციის დახმარებით
nambers2={}
nambers2=list(nambers2)
nambers1={1,2,3,4,5,6,7,8,9,10}
for i in nambers1:
    if i % 2==0:
        nambers2.append(i)
print(nambers2)
        

# 3.გაქვს სია მოსწავლეების ID-ებით. გადააქციე სეტად და შეამოწმე არის თუ არა ორჯერ შემოსული ერთი და იგივე ID
ids = set(["laliid","gioid","admingegechkoriid","datomodid","datomodid"])
print(ids.difference())