# 1)შექმენით სია სადაც გექნებათ რიცხვები მოცემული და ახალ სიაში ჩაამატეთ ისეთი რიცხვები რომლებიც იყოფა 3ზეც და 5 ზეც

# 2)შექმენით სია სადაც გექნებათ მოცემული სახელები, შემდეგ ახალ სიაში ჩაამატეთ ისეთი სახელები სახელები რომლის 
# სიმბოლოების რაოდენობაც არის ლუწი რიცხვი

# 3) ახსენით კომენტარებით რაში გვჭირდება list comprehension
#list comprehension გვეხმარება რომ უფრო ადვილად და უფრო მოკლედ დავწეროთ ჩვენი კოდი და ის გვჭირდება რომ ადვილად და უკეთესად დავწეროთ კოდი


list=[5,7,2,3,4,5,6,10]

list1=[]
for i in list:
    if i % 3==0:
        list1.append(i)
    elif i % 5==0:
        list.append(i)

names=["nika","dato","saba","giorgi","mariami","irakli"]

names2=[]
for i in names:
    if len(i) % 2==0:
        names2.append(i)
    