# 1) შექმენით 2 ცვლადი და მესამე ცვლადში შეინახეთ, წინა ორი ცვლადის მნიშვნელობების ჯამი და გამოიტანეთ შედეგი ეკრანზე.


# 2)დაწერეთ 5 არასწორი კოდი, გაასწორეთ მათში შეცომები და კომენტარებით ახსენით რა შეცდომები იყო კოდში და დაწერეთ გასწორებული ვერსია

# 3)ახსენით კომენტარებით რა არის Debugging

#1
num1 =5
num2 =5

print(num1 + num2)

#2
# print(nika)
# print"4")
# print"(300)"
# nika= (print)


print("nika") #ჭირდებოდა ბრჭყალები
print("4") #სჭირდებოდა ბრჭყალის დახურვა
print(300) #2 ცალი ბრჭყალი გარე არ სჭირდებოდა
print("nika") #პრინტი წინ უნდა იყოს და ბრჭყალებში უნდა იყოს სტრინგის ტიპი

#3
#Debugging არის შეცდომების დაფიქსვა