# num1 = int(input("შეიყვანეთ პირველი რიცხვი: "))
# num2 = int(input("შეიყვანეთ მეორე რიცხვი: "))

# print(int(num1) + (num2)   #  შეკრება
# print(int(num1) - (num2)  # გამოკლება
# print(int(num1) * (num2)  # გამრავლება
# print(int(num1) / (num2)  # გაყოფა
# print(int(num1) % (num2)  # ნაშთიანი გაყოფა 



# # საუკეთესო პრაქტიკები პროგრამირებაში
# # 1. კოდის წაკითხვადობა: კოდი უნდა იყოს გასაგები
# # 2. კომენტარები: აუცილებელია კოდის ახსნა, განსაკუთრებით რთულ ნაწილებში.
# # 3. ცვლადების შინაარსიანი სახელები: გაურკვეველი სახელების ნაცვლად, სახელები უნდა ასახავდეს მნიშვნელობას.

# # რა არის snake_case ი
# # snake_case არის სტილი, სადაც ცვლადის ან ფუნქციის სახელები იწერება პატარა ასოებით და დიდი ასოებით
# # სიტყვებს შორის გამოსაყოფად გამოიყენება ქვედატირე _.


# # Case sensitivity ნიშნავს, რომ პროგრამირების ენა განასხვავებს დიდ და პატარა ასოებს.
# # მაგალითად, Python-ში შემდეგი ორი ცვლადი სხვადასხვა ცვლადად ითვლება:
# Nam12 = 5
# nam13= 10
# print(Nam12)  # 5
# print(nam13)  #10 